/*9) Точки А, В, С і D задані своїми координатами на площині. Знайти положення точок A та B відносно прямої CD.*/
// Вхідні дані: координати точок (x, y) - A, B, C та D
// Bихідні дані: рядок, який зберігає результат роботи програми

#include <iostream>
#include <Windows.h>
#include <math.h>
#include <string>

using namespace std;

int main()
{
	// підтримка кирилиці в консолі Windows
	setlocale(LC_CTYPE, "rus"); // вызов функции настройки локали

	// оголошення змінних для зберігання значень координат точок:
	//C(Cx, Cy), D(Dx, Dy), A(Ax, Ay), B(Bx, By)
	float Cx, Cy, Dx, Dy, Ax, Ay, Bx, By;

	// змінна, яка в залежності від введених даних видає той чи інший результат -
	// («Точки А і В лежать за одну сторону від прямої») або («Точки А і В лежать по різні сторони від прямої»)
	string rehenie_zadachi = "!Відповідь відсутня!";

	//для отримання можливості побудови прямої використовується координати 2-ох точок - C, D
	cout << "!Перевірка на можливість побудувати пряму за точками C і D!" << endl;
	cout << "Введіть координати точки С(Cx, Cy): "; cin >> Cx >> Cy;
	cout << "Введіть координати точки D(Dx, Dy): "; cin >> Dx >> Dy;

	cout << "!Розміщення точок А та В на координатній площині!" << endl << endl;
	cout << "Введіть координати точки А(Ax, Ay): "; cin >> Ax >> Ay;
	cout << "Введіть координати точки В(Bx, By): "; cin >> Bx >> By;

	//перевірка на корректність введених даних 
	if ((Ax == Bx && Ay == By) || (Cx == Dx && Cy == Dy))
	{
		if (Ax == Bx && Ay == By) rehenie_zadachi = "!Точки А і В співпадають!";
		else rehenie_zadachi = "!Неможливо побудувати пряму!";
	}
	else
	{
		// 1 випадок - координати X та Y не збігаються або збігаються координати Y точок C та D
		if ((Cx != Dx && Cy != Dy) || (Cx != Dx && Cy == Dy))
		{
			//рівняння прямої y = kx + b
			//знаходження коефіцієнту k і вільного члена b
			float k, b = 0;
			k = (Dy - Cy) / (Dx - Cx);
			b = Dy - k * Dx;
			//чи лежать точки А та В водночас вище чи нижче прямої
			if (((Ay > k * Ax + b) && (By > k * Bx + b)) || ((Ay < k * Ax + b) && (By < k * Bx + b)))
				rehenie_zadachi = "!Точки А і В лежать за одну сторону від прямої!";
			else if ((Ay == k * Ax + b) || (By == k * Bx + b)) rehenie_zadachi = "!Одна або 2 з точок (А В) лежить (-ать) на прямій!";
			else rehenie_zadachi = "!Точки А і В лежать по різні сторони від прямої!";
		}
		else
		{	// 2 випадок - пряма проходить через спільний Х точок C та D
			if ((Ax > Cx && Bx > Cx) || (Ax < Cx && Bx < Cx))
				rehenie_zadachi = "!Точки А і В лежать за одну сторону від прямої!";
			else rehenie_zadachi = "!Точки А і В лежать по різні сторони від прямої!";
		}
	}

	cout << rehenie_zadachi << endl; // результат роботи програми
	system("PAUSE");  // затримка для перегляду результату
	return 0;  // вихід з функції main()

}
