/*9) Дано чотиризначне число N. Для формування числа М зробити циклічний зсув цифр числа N зліва направо на дві позиції.*/
// Вхідні дані: чотирьохзначне число М
// Bихідні дані: чотирьохзначне число N

#include <iostream> // директива препроцесора для підключення засобів 
#include <Windows.h>  // директива препроцесора для підтримки кирилиці в консолі 

using namespace std; // простір імен

int main()
{
	// підтримка кирилиці в консолі Windows 
	setlocale(LC_CTYPE, "rus"); // вызов функции настройки локали

	int First_Num; // вхідне число М
	int Second_Num; // вихідне число М

	//введення даних
	cout << "Введіть додатне чотирьхзначне число: "; cin >> First_Num;
	cout << "!!!Циклічний зсув цифр числа зліва направо на дві позиції!!!" << endl;

	Second_Num = (First_Num % 100) * 100 + (First_Num - (First_Num % 100)) / 100;

	// виведення результату 
	cout << "Результат = " << Second_Num << endl;

	system("PAUSE");  // затримка для перегляду результату
	return 0;  // вихід з функції main() 
}
