
/*9)   На прямокутний паралелепіпед (a × b × H) поставили правильну трикутну піраміду з довжиною сторін основи c та довжиною бічного ребра d, поєднавши вісь симетрії фігур.*/
// Вхідні дані: ширина та довжина основи паралелепіпеду, висота паралелепіпеду, 
// бічне ребро правильної трикутної піраміди, довжина сторони основи піраміди. 
// Bихідні дані: об'єм та площа фігури - дійсні числа 
/*
#include <iostream> // директива препроцесора для підключення засобів 
#include <Windows.h>  // директива препроцесора для підтримки кирилиці в консолі 
#include <math.h> // директива препроцесора для підтримки математичних функцій

using namespace std; // простір імен

int main() // заголовок головної функції програми 
{
	// підтримка кирилиці в консолі Windows 
	setlocale(LC_CTYPE, "rus"); // вызов функции настройки локали

	float a, b, H, c, d;
	// оголошення змінних для зберігання значень ширина та довжина основи паралелепіпеду, 
	//висоти паралелепіпеду, бічне ребро правильної трикутної піраміди, довжина сторони основи піраміди
	float S; // площа
	float V; // об'єм

	//введення даних
	cout << "Введіть ширину паралелепіпеду: "; cin >> a;
	cout << "Введіть довжину паралелепіпеду: "; cin >> b;
	cout << "Введіть висоту паралелепіпеду: "; cin >> H;
	cout << "Введіть бічне ребро правильної трикутної піраміди: "; cin >> c;
	cout << "Введіть довжина сторони основи піраміди: "; cin >> d;

	S = abs(a*b - (pow(3, 0.5)*pow(c, 2))*4); //обчислення площі
	V = a * b * H + ((((pow(d, 2) - pow(c,2)/3) * pow (c,2))/4 * pow(3,0.5))); //обчислення об'єму

	// виведення результату 
	cout << "Площа = " << S << endl;
	cout << "Об'єм = " << V << endl;

	system("PAUSE");  // затримка для перегляду результату
	return 0;  // вихід з функції main() 
}
*/