//9) -8a3 - 48a2b - 96ab2 - 64b3
//Вхідні дані : a і b дійсні числа
//Вихідні данні : Result число
#include <iostream> // директива препроцесора для підключення засобів 
#include <Windows.h> // директива препроцесора для підтримки кирилиці в консолі 

using namespace std; // простір імен

int main() // заголовок головної функції програми 
{  

	// підтримка кирилиці в консолі Windows 
	setlocale(LC_CTYPE, "rus"); // вызов функции настройки локали

	float a, b = NULL; // Оголошення зміних під a і b
	float Result; // Оголошення зміної під результат
	cout << "Введіть a: "; 	cin >> a; // Ввід з клавіатури
	cout << "Введіть b: ";	cin >> b;

	Result = pow(a + 2 * b, 3) + 6 * a * pow(b, 2); // Підрахунок результату

	cout << "Результат: " << Result << endl; // Вивід у консоль
	system("PAUSE"); // Пауза консолі
	return 0; // Вихід з "мейну" 
}
