///*9)   Дано натуральне число n > 1. Задані правила:
//а0 = а1 = 1; аі = аі - 2 + (а1 - 1) / (2 ^ (і - 1)); і = 2, 3, ...
//Знайти а0 * а1 * ... * аn
//*/
//
//#include <iostream>
//#include <Windows.h>
//#include <math.h>
//
//using namespace std;
//
//int main()
//{
//	setlocale(LC_CTYPE, "rus");
//
//	// оголошення змінних для зберігання значень:
//	//current_a - поточний член ряду, n - кількість членів у ряді; 
//	//mul - результат множення всіх членів ряду між собою;
//	//temp1, temp2 - змінні, які потрібні для зберігання передпопереднього та попереднього значень членів.
//	float temp1, temp2, current_a, mul; int n;
//	//присвоєння temp1 і temp2 значення першого і другого значень членів числового ряду відповідно
//	temp1 = temp2 = mul = 1;
//	cout << "Будь-який член ряду = аi - 2 + (а1 - 1) / (2 ^ (i - 1))" << endl;
//	cout << "Добуток = а0 * а1 * ... * аi" << endl << endl;
//	cout << "Введіть кількість членів числового ряду (n >= 2): ";  cin >> n;
//	for (; n < 2; ) //перевірка на коректність введених даних
//	{
//		cout << "Кількість членів числового ряду повинна бути не менше 2. Повторіть спробу!" << endl;
//		cout << "Введіть кількість членів числового ряду (n >= 2): "; cin >> n;
//	}
//
//	//за допомогою циклу обчислюємо добуток, починаючи з 3-го елементу, оскількі 1 і 2 = 1
//	for (int i = 2; i <= n; i++)
//	{
//		current_a = temp1 + (temp2) / pow(2, i - 1); //за формулою знаходимо поточний член ряду
//		//зміщуємо передпопереднє та попереднє значення числового ряду на наступний за індексом значення
//		temp1 = temp2;
//		temp2 = current_a;
//		//
//		mul *= current_a; //обчислюємо добуток числового ряду
//	}
//	cout << "Добуток числового ряду = " << mul << endl; //вивід отриманого значення
//	system("PAUSE");  // затримка для перегляду результату
//	return 0;  // вихід з функції main()
//}
